---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.MEPHiddenLineSettings
source: html/e2bda5b8-efc2-9942-1fc5-3ac48e829df3.htm
---
# MEPHiddenLineSettings Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.